Tekla Open API Reference for Tekla Structures 2025
Angle.DecimalPlaces Property
 Gets the number of decimal places used for angles.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static int DecimalPlaces { get; set; }
Public Shared Property DecimalPlaces As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Angle Class
Tekla.Structures.Datatype Namespace